tests/Mock/RefundPending.txt

HTTP/1.1 201 Created
Date: Thu, 01 May 2025 01:43:28 GMT
Content-Length: 241
Content-Type: application/json; charset=utf-8
Correlation-Id: 11111111-2222-3333-4444-abcdefabcdef
Api_Auth: true
Strict-Transport-Security: max-age=16000000; includeSubDomains; preload;

{"refundOutput":{"amountOfMoney":{"amount":145,"currencyCode":"EUR"},"references":{"merchantReference":"123abc"},"operationReferences":{"merchantReference":"123abc"},"cardRefundMethodSpecificOutput":{"totalAmountPaid":145,"totalAmountRefunded":0},"paymentMethod":"card"},"status":"REFUND_REQUESTED","statusOutput":{"isCancellable":false,"statusCategory":"PENDING_CONNECT_OR_3RD_PARTY","statusCode":81},"id":"0000000001_1"}